Revit 2026 API

# ContourSettingEnableItem Method

---

Enable a contour setting item of the current contour setting so that the item will be used to draw contours.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void EnableItem(
	ContourSettingItem item
)
```
```vb
Public Sub EnableItem (
	item As ContourSettingItem
)
```
```cpp
public:
void EnableItem(
	ContourSettingItem^ item
)
```
```fsharp
member EnableItem :
        item : ContourSettingItem -> unit
```

#### Parameters

item ContourSettingItem
     The contour setting item to be enabled.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Contour setting will not be changed if the item could not be found.

#### Reference

ContourSetting Class

Autodesk.Revit.DB Namespace